In [41]:
import pandas as pd

In [42]:
f=pd.read_csv('book1.csv')
print(f)

   sr     name   sub  marks  marks 1
0  101  harsh    daa   45.0     47.0
1  102   mihir   ccv   48.0     48.0
2  103   dioen   ccn   41.0     49.0
3  104    zeel    cs   49.0     45.0
4  105   kenil    ws    NaN     46.0
5  106  harshu   jee   47.0     35.0
6  107  harshd   zee   20.0     39.0
7  108    jeel  need   47.0      NaN

In [43]:
f.shape

(8, 5)

In [44]:
# the head is not count in auto first 5 record.
f.head()

   sr     name  sub  marks  marks 1
0  101  harsh   daa   45.0     47.0
1  102   mihir  ccv   48.0     48.0
2  103   dioen  ccn   41.0     49.0
3  104    zeel   cs   49.0     45.0
4  105   kenil   ws    NaN     46.0

In [5]:
# the tail is not count auto last 5 record.
f.tail()

   sr     name   sub  marks  marks 1
3  104    zeel    cs   49.0     45.0
4  105   kenil    ws    NaN     46.0
5  106  harshu   jee   47.0     35.0
6  107  harshd   zee   20.0     39.0
7  108    jeel  need   47.0      NaN

In [6]:
f.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   sr       8 non-null      int64
 1   name     8 non-null      object
 2   sub      8 non-null      object
 3   marks    7 non-null      float64
 4   marks 1  7 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 448.0+ bytes

In [7]:
f.describe()

             sr       marks    marks 1
count    8.00000   7.000000   7.000000
mean   104.50000  42.428571  44.142857
std      2.44949  10.228345   5.177791
min    101.00000  20.000000  35.000000
25%    102.75000  43.000000  42.000000
50%    104.50000  47.000000  46.000000
75%    106.25000  47.500000  47.500000
max    108.00000  49.000000  49.000000

In [8]:
c=f.columns

In [9]:
print(c)

Index(['sr ', 'name', 'sub', 'marks', 'marks 1'], dtype='object')

In [10]:
f.isnull().sum()

sr         0
name       0
sub        0
marks      1
marks 1    1
dtype: int64

In [11]:
f.dropna(inplace =True)

In [12]:
f.shape

(6, 5)

In [13]:
f.isnull().sum()

sr         0
name       0
sub        0
marks      0
marks 1    0
dtype: int64

In [14]:
r=f['marks']
print(r)

0    45.0
1    48.0
2    41.0
3    49.0
5    47.0
6    20.0
Name: marks, dtype: float64

In [15]:
type(r)

pandas.core.series.Series

In [16]:
r.mean()

41.666666666666664

In [17]:
r2=f[['name','sub']]
print(r2)

     name  sub
0  harsh   daa
1   mihir  ccv
2   dioen  ccn
3    zeel   cs
5  harshu  jee
6  harshd  zee

In [18]:
type(r2)

pandas.core.frame.DataFrame

In [19]:
r.fillna(r.mean,inplace=True)
r

0    45.0
1    48.0
2    41.0
3    49.0
5    47.0
6    20.0
Name: marks, dtype: float64

In [20]:
f.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 6
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   sr       6 non-null      int64
 1   name     6 non-null      object
 2   sub      6 non-null      object
 3   marks    6 non-null      float64
 4   marks 1  6 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 288.0+ bytes

In [21]:
m=f['marks 1']
print(m)

0    47.0
1    48.0
2    49.0
3    45.0
5    35.0
6    39.0
Name: marks 1, dtype: float64

In [22]:
m.isnull().sum()

0

In [23]:
m.mean()

43.833333333333336

In [24]:
m.fillna(m.mean,inplace=True)

In [25]:
m.isnull().sum()

0

In [26]:
f.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 6
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   sr       6 non-null      int64
 1   name     6 non-null      object
 2   sub      6 non-null      object
 3   marks    6 non-null      float64
 4   marks 1  6 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 288.0+ bytes

In [27]:
f.shape

(6, 5)

In [28]:
df3= f.append(f)
df3

C:\Users\DELL\AppData\Local\Temp\ipykernel_12216\2201779115.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3= f.append(f)

   sr     name  sub  marks  marks 1
0  101  harsh   daa   45.0     47.0
1  102   mihir  ccv   48.0     48.0
2  103   dioen  ccn   41.0     49.0
3  104    zeel   cs   49.0     45.0
5  106  harshu  jee   47.0     35.0
6  107  harshd  zee   20.0     39.0
0  101  harsh   daa   45.0     47.0
1  102   mihir  ccv   48.0     48.0
2  103   dioen  ccn   41.0     49.0
3  104    zeel   cs   49.0     45.0
5  106  harshu  jee   47.0     35.0
6  107  harshd  zee   20.0     39.0

In [29]:
df3.shape

(12, 5)

In [30]:
df3.drop_duplicates()

   sr     name  sub  marks  marks 1
0  101  harsh   daa   45.0     47.0
1  102   mihir  ccv   48.0     48.0
2  103   dioen  ccn   41.0     49.0
3  104    zeel   cs   49.0     45.0
5  106  harshu  jee   47.0     35.0
6  107  harshd  zee   20.0     39.0

In [31]:
   #new item

In [32]:
  #Importing Pandas Library
import pandas as pd

#Creating a Sample DataFrame
data = pd.DataFrame({
        'id': [ 101, 123, 139, 112, 133],
        'age': [ 10, 12, 13, 11, 12],
        'gender': [ 'M', 'F', 'F', 'M', 'M'],
        'group': [ 'first', 'second', 'first', 'third', 'third'],
        'math_score': [ 41.5, 43, 38, 47, 29.5]
    })

data

    id  age gender   group  math_score
0  101   10      M   first        41.5
1  123   12      F  second        43.0
2  139   13      F   first        38.0
3  112   11      M   third        47.0
4  133   12      M   third        29.5

In [33]:
#Adding a column using List
values = [40, 38, 33, 30,'']

data['Marks'] = values
data

    id  age gender   group  math_score Marks
0  101   10      M   first        41.5    40
1  123   12      F  second        43.0    38
2  139   13      F   first        38.0    33
3  112   11      M   third        47.0    30
4  133   12      M   third        29.5

In [34]:
data['Marks_Maths'] = pd.Series([40, 38, 32.5, 27, 30],index=[1, 2, 3, 4, 5])
print(data)

    id  age gender   group  math_score Marks  Marks_Maths
0  101   10      M   first        41.5    40          NaN
1  123   12      F  second        43.0    38         40.0
2  139   13      F   first        38.0    33         38.0
3  112   11      M   third        47.0    30         32.5
4  133   12      M   third        29.5               27.0

In [35]:
#Adding columns using assign()
s1 = pd.Series([40.5, 38.5, 33, 28, 31], index=[0, 1, 2, 3, 4])
s2 = pd.Series([48.5, 42, 41, 37, 43], index=[0, 1, 2, 3, 4])

data.assign(DBMS_score=s1.values, Python_score=s2.values)

,id,age,gender,group,math_score,Marks,Marks_Maths,DBMS_score,Python_score
0,101,10,M,first,41.5,40,NaN,40.5,48.5
1,123,12,F,second,43.0,38,40.0,38.5,42.0
2,139,13,F,first,38.0,33,38.0,33.0,41.0
3,112,11,M,third,47.0,30,32.5,28.0,37.0
4,133,12,M,third,29.5,,27.0,31.0,43.0

In [36]:
#Adding a column using insert()
#insert a new column in a specific position or index.
data.insert(len(data.columns), 'Cloud_score', s2.values)
print(data)

    id  age gender   group  math_score Marks  Marks_Maths  Cloud_score
0  101   10      M   first        41.5    40          NaN         48.5
1  123   12      F  second        43.0    38         40.0         42.0
2  139   13      F   first        38.0    33         38.0         41.0
3  112   11      M   third        47.0    30         32.5         37.0
4  133   12      M   third        29.5               27.0         43.0

In [37]:
data.insert(4, 'Python_score', s2.values)
print(data)

    id  age gender   group  Python_score  math_score Marks  Marks_Maths  \
0  101   10      M   first          48.5        41.5    40          NaN
1  123   12      F  second          42.0        43.0    38         40.0
2  139   13      F   first          41.0        38.0    33         38.0
3  112   11      M   third          37.0        47.0    30         32.5
4  133   12      M   third          43.0        29.5               27.0

   Cloud_score
0         48.5
1         42.0
2         41.0
3         37.0
4         43.0

In [38]:
#Adding duplicate columns using insert()
#The allow_duplicates parameter is set to False by default and returns a ValueError if the new column has a duplicate column name.
s3 = pd.Series([43, 34, 33.5, 29, 47], index=[0, 1, 2, 3, 4])

data.insert(5, 'Python_score', s3.values, allow_duplicates=True)
print(data)

    id  age gender   group  Python_score  Python_score  math_score Marks  \
0  101   10      M   first          48.5          43.0        41.5    40
1  123   12      F  second          42.0          34.0        43.0    38
2  139   13      F   first          41.0          33.5        38.0    33
3  112   11      M   third          37.0          29.0        47.0    30
4  133   12      M   third          43.0          47.0        29.5

   Marks_Maths  Cloud_score
0          NaN         48.5
1         40.0         42.0
2         38.0         41.0
3         32.5         37.0
4         27.0         43.0

In [39]:
#adding empty column
data['avg_score'] = pd.NaT
data
#pd.NaT denotes missing or null values in the Pandas DataFrame.

,id,age,gender,group,Python_score,Python_score,math_score,Marks,Marks_Maths,Cloud_score,avg_score
0,101,10,M,first,48.5,43.0,41.5,40,NaN,48.5,NaT
1,123,12,F,second,42.0,34.0,43.0,38,40.0,42.0,NaT
2,139,13,F,first,41.0,33.5,38.0,33,38.0,41.0,NaT
3,112,11,M,third,37.0,29.0,47.0,30,32.5,37.0,NaT
4,133,12,M,third,43.0,47.0,29.5,,27.0,43.0,NaT

In [40]:
#Adding a column with a constant value 70
data['total_score'] = 70
data

,id,age,gender,group,Python_score,Python_score,math_score,Marks,Marks_Maths,Cloud_score,avg_score,total_score
0,101,10,M,first,48.5,43.0,41.5,40,NaN,48.5,NaT,70
1,123,12,F,second,42.0,34.0,43.0,38,40.0,42.0,NaT,70
2,139,13,F,first,41.0,33.5,38.0,33,38.0,41.0,NaT,70
3,112,11,M,third,37.0,29.0,47.0,30,32.5,37.0,NaT,70
4,133,12,M,third,43.0,47.0,29.5,,27.0,43.0,NaT,70